{
  "pages": [
    {
      "title": "Python, cmd və Hotspot. Pythonla Wifi Hotspot yaradaq.",
      "tags": "Python",
      "text": "Kompyuterdə olan internetin digər cihazlara kompyuterin wifi adapteri ilə paylanmasına el arasında HotSpot deyirlər. Əgər siz wifi modemdən istifadə edirsinizsə təbiiki artıq buna ehtiyacınız qalmır. Amma mobil modemlərdən istifadə edənlər(elə biri də mən) gec tez belə bir metoda baş vururlar. Gəlin bir də bunu pythonla edək.\n\n\nKompyuterdə olan internetin digər cihazlara kompyuterin wifi adapteri ilə paylanmasına el arasında HotSpot deyirlər. Əgər siz wifi modemdən istifadə edirsinizsə təbiiki artıq buna ehtiyacınız qalmır. Amma mobil modemlərdən istifadə edənlər(elə biri də mən) gec tez belə bir metoda baş vururlar. Mən də adətən bu metodlardan istifadə edirəm. Belə şəbəkəni paylamaq üçün bir çox programlar mövcuddur. Bu programlara misal olaraq Wifi Hotspot, Connectify, Maryfi kimi programları göstərə bilərik. Elə yaxın zamana qədər mən də bu programlardan istifadə edirdim. Lakin dəyişməyən şey bu programlarda çıxan problemlər olurdu. Adətən məndə bu programlar tez-tez donur, çox yaddaş yeyir ip confiqurasiyalara barmaq edir və s bir çox belə kiçik məsələlər ilə başımı ağrıdırdılar. Bir dostumun da mənə bu məsələdə şikayət etməsi məni vadar elədi ki bu məsələyə bir az ciddi yanaşım. Deməli belə, bu məsələdə demək olar ki mən bütün yollara baş vurdum. Ən effektiv həll yolu isə şəbəkəni elə Command Line-dan istifadə edərək yaratmaqdı qərarına gəldim. Lakin hər dəfə Kompyuteri açdıqdan sonra cmd-ni açıb əllə əmrlər yazmaq da bir az bezdirici idi. Axır ki məsələyə Pythonu da qatdım və məsələni kökündən həll elədim. Əvvəla bunu deyim ki, cmd ilə şəbəkəni paylamaq üçün aşağıdakı əmrlərdən istifadə edirdim:\nnetsh wlan set hostednetwork mode=allow ssid=name key=password # Parolu və şəbəkənin görünən adını təyin etmək üçün.\n\nnetsh wlan start hostednetwork #şəbəkəni işə salmaq üçün.\n\n\n\nHər dəfə bu əmrləri cmd-də yazmaq əvəzinə bu prosesi pythonla avtomatlaşdırdım. Dostum da istifadə edə bilsin deyə Tkinter vasitəsilə Gui də yığdım.\nBir az kobud oldu amma əsas odur ki işləyir :)\n#coding = utf-8\n#Wifi Hotspot Creator\nfrom tkinter import *\nimport subprocess\n\nwindow = Tk()\nwindow.title('WIFI Hotspot Creator')\nwindow.resizable(False, False)\n\nssid = Label(text=\"Wifi adı: \")\nssid.grid(row=0, column=0, sticky=\"w\")\npasword = Label(text=\"Parol: \")\npasword.grid(row=1, column=0, sticky=\"w\")\ndef wifi():\n    ssid = entry.get()\n    parol = entry1.get()\n    subprocess.call('netsh wlan set hostednetwork mode=allow ssid={0} key={1}' .format(ssid, parol), shell=True)\n    subprocess.call('netsh wlan start hostednetwork', shell=True)\nentry = Entry()\nentry.grid(row=0, column=1, padx=10)\nentry1 = Entry(show='*')\nentry1.grid(row=1, column=1, padx=10)\nbutton = Button(text=\"Start\", command=wifi)\nbutton.grid(padx=10, pady=10)\ndef stop():\n    subprocess.call('netsh wlan stop hostednetwork', shell=True)\nbutton1 = Button(text='Stop', command=stop)\nbutton1.grid( row=2, column=2, padx = 10, pady = 10)\n\nmainloop()\n\n\n\nProgramı yüklə\nİstifadə qaydası:\n\nDemək mən burda neynədim: demək olar ki heçnə. Sadəcə pythonun subprocess modulundan istifadə edərək  cmd əmrlərini yerinə yetirdim.\n Amma özünüzün əllə bir dəfə etməli olduğunuz bir şey var. Paylayacağınız connetionun Sharing parametrlərini tənzimləmək. Belə edə bilərsiniz:\nDaxil olursunuz: Control Panel >> Network and Internet >> Network Connections bölməsinə(rusca: Панель управления>>Сеть и Интернет>>Сетевые подключения).\n\nŞəkildə göründüyü kimi paylaşacağınız connectionu seçirsiniz:\n\nSonra:\n\nHansı connectionla paylaşacağınızı seçirsiniz:\nBöyük ehtimalla bu sizdə Wireless Network Connection 2 olacaq(Microsoft Virtual WiFi Miniport Adapter)(rusca:Беспроводное сетевое соединение 2).\nSettings bölməsinə daxil olursunuz.\n\nAşağıdakı şəkildə göstərilənlərə quş qoyursuz. Daha doğrusu şəkildə hansılarda quş varsa siz də onu quşduyun:D\n\nHər şeyə OK vurun. Və yüklədiyiniz zip faylını extract edin və bbc.exe faylını açın və istifadə edin.\nBu arada, bütün adapterlər dəstəklənmir. Dəstəklənən adapterlərin siyahısı:\n\nAtheros AR5xxx/AR9xxx cards, driver version 8.0.0.238\nBroadcom 4310-series (in many Dell laptops)\nBroadcom 4321AG/4322AG/43224AG WLAN Adapter, driver version 5.60.18.8\nD-link AirPlus G DWL-G510 Wireless PCI Adapter, driver version 3.0.1.0\nD-Link DWA-140 Range Booster N USB Adapter, driver version 3.0.3.0\nDell 1510 Wireless N adapter, Broadcom  version, driver 5.60.18.8,\nIntel 5100/5300, WiFi Link 1000 BGN, driver version 13.0.0.107\nLinksys Dual-Band Wireless-N USB Network Adapter(WUSB600N), driver version 3.0.10.0\nNetgear 108 Mbit WG311T\nRalink RT2870 (in many 802.11n USB dongles)\nRealtek RTL8187B (Win7 driver ver.1178)\nRealtek RTL8187SE (with the drivers that came with Windows 7)\nRealtek RTL8192u with 1370(Beta)\nSitecom Wireless USB Adapter 54g WL-608, with Ralink RT2870 drivers, version 3.0.9.0\n\nBu da son. Uğurlar.",
      "loc": "/posts/Pythondan istifadə edərək Command Line əmrləri vasitəsilə Hotspot necə yaratmaq olar..html"
    },
    {
      "title": "Pythonda random modulu",
      "tags": "Modullar,Python",
      "text": "Çoxdandır Pythonda istifadə olunan random modulunun yaratdığı verilənlərin hansı alqoritmə uyğun olaraq istehsal olunduğu haqqında maraqlanmaq istəyirdim. Amma nə isə vaxt olmurdu. Blogumda da ilk olaraq nə yazım deyə düşünürdüm. Təsadüfən qərara gəldim ki bu mövzu haqqında yazım.\n\nÜmumiyyətlə fəlsəfədə və fizikada determinizim qanunları deyilən qanunlar var ki bizim istifadə etdiyimiz cihazlar bu qanunlara tabedir.\nAlqoritmlər\nHal-hazırda kompyuterlərdə istifadə olunan alqoritmlər psevdorandom alqoritmlər adlanır. Psevdorandom alqoritm hansısa riyazi bir düstura tabe olan alqoritmlərdir.\nBizim dilə tərcümə etməyə çalışsaq nisbi təsadüfi alqoritmlər. Bu alqoritmlər çox qəliz bir riyazi məntiqlə yığılıb və \"əsl\" təsadüfiliyə yaxın rəqəmlər istehsal edə bilirlər.\nÜmumiyyətlə bunu da deyim ki riyazi əməliyyatlardan istifadə edərək random alqoritmlər yığmaq mümkündür lakin bunu hal-hazırda istifadə etdiyimiz deterministik komyputerlərdə istifadə etmək mümkün deyil.\nRandom alqoritmləri psevdorandom alqoritmlərdən ayıran tək fərq var: psevdorandom alqoritmlərə periodiklik məxsusdur. Yəni ki bir müddətdən sonra özlərini təkrar edirlər.\nÇünki generator sabit bir yaddaşdan istifadə edir, periodik olmasa onda sistem işlədikcə daha çox yaddaş istifadə etməyə başlayacaq. Və sonsuza qədər bunu etməyə çalışacaq ki, bizim istifadə etdiyimiz kompyuterlər sabit yaddaşa malikdirlər.\nPythonda Random modulu\nPythonda random rəqəmlər yaratmaq üçün random adlı modul var. Bir çox proqramlaşdırma dilləri kimi python da psevdorandom məlumatlar yaratmaq üçün Mersenne twister PRNG-dan istifadə edir.\nKeçək random modulunun istifadəsinə. Random modulunun bir çox yararlı funksiyaları var aşağıda misallarla bu funksiyaların izahını verməyə cəhd edəcəm.\nRandint Funksiyası\nƏgər biz random rəqəmlər yaratmaq istəyiriksə randint funksiyasından istifadə edə bilərik. randint funksiyası iki parametr qəbul edə bilir: başlanğıc nöqtə və son nötə. məsələn əgər biz pythondan 1-dən 10-a qədər olan rəqəmlər arasından təsadüfi bir rəqəm seçməsini istəsək randint funksiyası ilə belə edə bilərik:\nimport random\nrandom.randint(1,10)\n\n\n\nChoice funksiyası\nVerilən siyahıdan random elementlər seçmək üçün istifadə olunur. Məsələn:\nimport random\nrandom.choice(['alma', 'armud', 'nar', 'heyva'])\n\n\n\nvə ya\nimport random\nmylist=['kitab', 'dəftər', 'karandaş', 'qələm']\nrandom.choice(mylist)\n\n\n\nShuffle funksiyası\nVerilən siyahıdakı elementləri random şəkildə sıralayaraq bizə təqdim edir. Fisher-Yates alqoritminə əsaslanır.choice funksiyası verilən siyahıdan təsadüfi bir element seçib bizə təqdim edir lakin shuffle funksiyası isə tam siyahını təsadüfi şəkildə sıralayır. Məsələn:\nimport random\nmylist=(['alma', 'armud', 'nar', 'heyva'])\nrandom.shuffle(mylist)\nprint(mylist)\n#Məndə alınan nəticə:['armud', 'nar', 'alma', 'heyva'], təbiiki sizdə tam fərqli olacaq\n\n\n\nvə ya\nimport random\nx = [[i] for i in range(10)]\nrandom.shuffle(x)\nprint(x)\n#Məndə alınan nəticə:[[4], [5], [1], [3], [2], [8], [6], [7], [9], [0]]\n\n\n\nRandom funksiyası\nDefault olaraq 0.0 və 1.0 arasında bir rəqəm seçir. Amma əgər siz böyük rəqəm almaq istəyirsinizsə belə edə bilərsiz:\nimport random\nrandom.random()*6000\n\n\n\nRandrange funksiyası\nrandrange funksiyası verilmiş aralıqdakı rəqəmlərdən təsadüfi olaraq bir rəqəm seçir. 3 parametr qəbul edir.\nStart - başlanğıc nöqtəsi\nStop - Son nöqtə\nStep - Addım. Verilmiş aralıqda neçə addımdan bir element seçmək üçün.\nBəli parametrlərindəki step məsələsi bir az qəliz məsələdi. Amma daha yaxşı anlamaq üçün range() funksiyasına baxmalıyıq. Çünki eyni prinsiplə işləyirlər.\nBu funksiyaya alternativ olaraq random.choice(range(start, stop, step) funsksiyasından istifadə edə bilərik.\nRandom modulunun bir çox funksiyaları var lakin geniş şəkildə istifadə olunan funksiyaları yuxarıdakılar idi. Bu modul haqqında daha ətraflı məlumat əldə etmək istəyirsinizsə modulun öz dokumentasiyasına  baxmağınızı məsləhət görürəm.",
      "loc": "/posts/tsadfirandom-alqoritmlr-v-pythonda-random-modulu.html"
    },
    {
      "title": "About",
      "tags": "",
      "text": "Just another python beginner...\n>>> import this\nThe Zen of Python, by Tim Peters\nBeautiful is better than ugly.\nExplicit is better than implicit.\nSimple is better than complex.\nComplex is better than complicated.\nFlat is better than nested.\nSparse is better than dense.\nReadability counts.\nSpecial cases aren't special enough to break the rules.\nAlthough practicality beats purity.\nErrors should never pass silently.\nUnless explicitly silenced.\nIn the face of ambiguity, refuse the temptation to guess.\nThere should be one-- and preferably only one --obvious way to do it.\nAlthough that way may not be obvious at first unless you're Dutch.\nNow is better than never.\nAlthough never is often better than *right* now.\nIf the implementation is hard to explain, it's a bad idea.\nIf the implementation is easy to explain, it may be a good idea.\nNamespaces are one honking great idea -- let's do more of those!",
      "loc": "/stories/about.html"
    }
  ]
}